In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.702287  0.024769
1    a  two -1.599800 -1.118803
2    b  one -0.421189  0.959754
3    b  two  0.141742 -0.705502
4    a  one -0.780139  1.265683

In [3]:
df.groupby(by=['key1','key2']).sum()

              data1     data2
key1 key2
a    one  -0.077852  1.290452
     two  -1.599800 -1.118803
b    one  -0.421189  0.959754
     two   0.141742 -0.705502

In [5]:
df[['key1','data1','data2']].groupby(by='key1').sum()

         data1     data2
key1
a    -1.677652  0.171649
b    -0.279446  0.254252

In [6]:
df[['key2','data1','data2']].groupby(by='key2').sum()

         data1     data2
key2
one  -0.499041  2.250206
two  -1.458058 -1.824306

In [7]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.932433  0.833057
1    a  two -1.652147 -0.526444
2    b  one -0.317045  0.865188
3    b  two -0.471007 -0.126507
4    a  one  1.618762  1.840818

In [14]:
#將groupby物件,選取需要統計的欄位
df.groupby(['key1','key2'])[['data1']].sum()

              data1
key1 key2
a    one   3.551195
     two  -1.652147
b    one  -0.317045
     two  -0.471007

In [15]:
import pandas as pd
df1 = pd.read_csv('每日各站進出站人數2022.csv')
df1.columns = ['日期','code','進站','出站']
df1['日期'] = pd.to_datetime(df1['日期'].astype(str))
df1['月份'] = df1['日期'].dt.month
df1

              日期  code    進站    出站  月份
0     2022-01-01   900  8645  8526   1
1     2022-01-01   910   996  1243   1
2     2022-01-01   920  1369  1711   1
3     2022-01-01   930  3663  4535   1
4     2022-01-01   940  1532  1845   1
...          ...   ...   ...   ...  ..
86547 2022-12-31  7360  3984  3893  12
86548 2022-12-31  7361    92   115  12
86549 2022-12-31  7362   131   159  12
86550 2022-12-31  7380   494   426  12
86551 2022-12-31  7390   313   274  12

[86552 rows x 5 columns]

In [17]:
df1.groupby(by=['code','月份'])[['出站','進站']].sum()

             出站      進站
code 月份
900  1   177861  188317
     2   161807  170885
     3   201651  213987
     4   136851  144263
     5   107821  114120
...         ...     ...
7390 8    12918   12175
     9    12545   12331
     10   12705   12421
     11   14623   14489
     12   14202   13961

[2867 rows x 2 columns]

In [18]:
df1.groupby(by=['code'])[['出站','進站']].sum()

           出站       進站
code
900   2129512  2253504
910    422225   411286
920    646678   694663
930   1776557  1764417
940    753939   753424
...       ...      ...
7360  1120786  1095349
7361    22368    17106
7362    45962    37982
7380   205081   209800
7390   146951   140997

[239 rows x 2 columns]

In [19]:
df1.groupby(by=['月份'])[['出站','進站']].sum()

          出站        進站
月份
1   14331609  14331609
2   13090244  13090244
3   16465704  16465704
4   13741557  13741557
5    9699057   9699057
6   10838883  10838883
7   14225428  14225428
8   15660748  15660748
9   15458656  15458656
10  16528375  16528375
11  17161542  17161542
12  18157820  18157820

In [22]:
for item in df1.groupby(by='月份'):
    print(item)

(1,              日期  code    進站    出站  月份
0    2022-01-01   900  8645  8526   1
1    2022-01-01   910   996  1243   1
2    2022-01-01   920  1369  1711   1
3    2022-01-01   930  3663  4535   1
4    2022-01-01   940  1532  1845   1
...         ...   ...   ...   ...  ..
7364 2022-01-31  7360  1666  2003   1
7365 2022-01-31  7361    10    14   1
7366 2022-01-31  7362    48    51   1
7367 2022-01-31  7380   320   344   1
7368 2022-01-31  7390   175   216   1

[7369 rows x 5 columns])
(2,               日期  code    進站    出站  月份
7369  2022-02-01   900  4246  3723   2
7370  2022-02-01   910   771   696   2
7371  2022-02-01   920  1063   938   2
7372  2022-02-01   930  2818  2446   2
7373  2022-02-01   940   920   863   2
...          ...   ...   ...   ...  ..
14034 2022-02-28  7360  5192  5359   2
14035 2022-02-28  7361   218   229   2
14036 2022-02-28  7362   498   597   2
14037 2022-02-28  7380   605   536   2
14038 2022-02-28  7390   350   376   2

[6670 rows x 5 columns])
(3,               日期  code    進站    出站  月份
14039 2022-03-01   900  6801  6664   3
14040 2022-03-01   910  1408  1471   3
14041 2022-03-01   920  2325  2044   3
14042 2022-03-01   930  6124  6161   3
14043 2022-03-01   940  2617  2663   3
...          ...   ...   ...   ...  ..
21413 2022-03-31  7360  2903  2994   3
21414 2022-03-31  7361    11    16   3
21415 2022-03-31  7362    19    14   3
21416 2022-03-31  7380   661   680   3
21417 2022-03-31  7390   539   554   3

[7379 rows x 5 columns])
(4,               日期  code    進站    出站  月份
21418 2022-04-01   900  6378  5911   4
21419 2022-04-01   910  1277  1355   4
21420 2022-04-01   920  2449  2373   4
21421 2022-04-01   930  6249  6549   4
21422 2022-04-01   940  2661  2685   4
...          ...   ...   ...   ...  ..
28537 2022-04-30  7360  1932  2030   4
28538 2022-04-30  7361    48    59   4
28539 2022-04-30  7362    56    62   4
28540 2022-04-30  7380   349   364   4
28541 2022-04-30  7390   204   236   4

[7124 rows x 5 columns])
(5,               日期  code    進站    出站  月份
28542 2022-05-01   900   182   170   5
28543 2022-05-01   910    34    31   5
28544 2022-05-01   920    57    37   5
28545 2022-05-01   930   141   210   5
28546 2022-05-01   940    37    33   5
...          ...   ...   ...   ...  ..
35861 2022-05-31  7360  1878  1918   5
35862 2022-05-31  7361     6    10   5
35863 2022-05-31  7362    11    15   5
35864 2022-05-31  7380   484   484   5
35865 2022-05-31  7390   328   335   5

[7324 rows x 5 columns])
(6,               日期  code    進站    出站  月份
35866 2022-06-01   900  4521  4152   6
35867 2022-06-01   910   943   982   6
35868 2022-06-01   920  1656  1512   6
35869 2022-06-01   930  3850  3937   6
35870 2022-06-01   940  1826  1817   6
...          ...   ...   ...   ...  ..
42984 2022-06-30  7360  3215  3149   6
42985 2022-06-30  7361    42    64   6
42986 2022-06-30  7362    98   111   6
42987 2022-06-30  7380   576   585   6
42988 2022-06-30  7390   415   436   6

[7123 rows x 5 columns])
(7,               日期  code    進站    出站  月份
42989 2022-07-01   900  6321  5993   7
42990 2022-07-01   910  1119  1168   7
42991 2022-07-01   920  1983  1835   7
42992 2022-07-01   930  4920  4964   7
42993 2022-07-01   940  2278  2127   7
...          ...   ...   ...   ...  ..
50325 2022-07-31  7360  3475  3576   7
50326 2022-07-31  7361    92   140   7
50327 2022-07-31  7362   248   323   7
50328 2022-07-31  7380   413   453   7
50329 2022-07-31  7390   265   272   7

[7341 rows x 5 columns])
(8,               日期  code    進站    出站  月份
50330 2022-08-01   900  5929  5441   8
50331 2022-08-01   910  1166  1175   8
50332 2022-08-01   920  2114  1961   8
50333 2022-08-01   930  4814  4986   8
50334 2022-08-01   940  2217  2200   8
...          ...   ...   ...   ...  ..
57688 2022-08-31  7360  3143  3238   8
57689 2022-08-31  7361    47    65   8
57690 2022-08-31  7362    91   104   8
57691 2022-08-31  7380   628   645   8
57692 2022-08-31  7390   475   485   8

[7363 rows x 5 columns])
(9,               日期  code    進站    出站  月份
57693 2022-09-01   900  6097  5788   9
57694 2022-09-01   910  1251  1276   9
57695 2022-09-01   920  2172  1996   9
57696 2022-09-01   930  5650  5674   9
57697 2022-09-01   940  2353  2359   9
...          ...   ...   ...   ...  ..
64743 2022-09-30  7360  3930  3839   9
64744 2022-09-30  7361   157   172   9
64745 2022-09-30  7362   123   130   9
64746 2022-09-30  7380   696   741   9
64747 2022-09-30  7390   508   514   9

[7055 rows x 5 columns])
(10,               日期  code    進站    出站  月份
64748 2022-10-01   900  7897  7130  10
64749 2022-10-01   910  1019  1143  10
64750 2022-10-01   920  1800  1802  10
64751 2022-10-01   930  3978  3990  10
64752 2022-10-01   940  1755  1744  10
...          ...   ...   ...   ...  ..
72072 2022-10-31  7360  2428  2488  10
72073 2022-10-31  7361     5     4  10
72074 2022-10-31  7362     2     3  10
72075 2022-10-31  7380   629   628  10
72076 2022-10-31  7390   421   406  10

[7329 rows x 5 columns])
(11,               日期  code    進站    出站  月份
72077 2022-11-01   900  6193  5927  11
72078 2022-11-01   910  1327  1340  11
72079 2022-11-01   920  2184  1933  11
72080 2022-11-01   930  5922  5873  11
72081 2022-11-01   940  2435  2446  11
...          ...   ...   ...   ...  ..
79184 2022-11-30  7360  3025  3082  11
79185 2022-11-30  7361    22    24  11
79186 2022-11-30  7362    33    37  11
79187 2022-11-30  7380   767   711  11
79188 2022-11-30  7390   499   501  11

[7112 rows x 5 columns])
(12,               日期  code    進站    出站  月份
79189 2022-12-01   900  7021  6403  12
79190 2022-12-01   910  1341  1328  12
79191 2022-12-01   920  2314  2070  12
79192 2022-12-01   930  6040  6038  12
79193 2022-12-01   940  2499  2615  12
...          ...   ...   ...   ...  ..
86547 2022-12-31  7360  3984  3893  12
86548 2022-12-31  7361    92   115  12
86549 2022-12-31  7362   131   159  12
86550 2022-12-31  7380   494   426  12
86551 2022-12-31  7390   313   274  12

[7363 rows x 5 columns])

In [23]:
for month,grouped in df1.groupby(by='月份'):
    print(month)
    print(grouped)
    print("=======")

1
             日期  code    進站    出站  月份
0    2022-01-01   900  8645  8526   1
1    2022-01-01   910   996  1243   1
2    2022-01-01   920  1369  1711   1
3    2022-01-01   930  3663  4535   1
4    2022-01-01   940  1532  1845   1
...         ...   ...   ...   ...  ..
7364 2022-01-31  7360  1666  2003   1
7365 2022-01-31  7361    10    14   1
7366 2022-01-31  7362    48    51   1
7367 2022-01-31  7380   320   344   1
7368 2022-01-31  7390   175   216   1

[7369 rows x 5 columns]
=======
2
              日期  code    進站    出站  月份
7369  2022-02-01   900  4246  3723   2
7370  2022-02-01   910   771   696   2
7371  2022-02-01   920  1063   938   2
7372  2022-02-01   930  2818  2446   2
7373  2022-02-01   940   920   863   2
...          ...   ...   ...   ...  ..
14034 2022-02-28  7360  5192  5359   2
14035 2022-02-28  7361   218   229   2
14036 2022-02-28  7362   498   597   2
14037 2022-02-28  7380   605   536   2
14038 2022-02-28  7390   350   376   2

[6670 rows x 5 columns]
=======
3
              日期  code    進站    出站  月份
14039 2022-03-01   900  6801  6664   3
14040 2022-03-01   910  1408  1471   3
14041 2022-03-01   920  2325  2044   3
14042 2022-03-01   930  6124  6161   3
14043 2022-03-01   940  2617  2663   3
...          ...   ...   ...   ...  ..
21413 2022-03-31  7360  2903  2994   3
21414 2022-03-31  7361    11    16   3
21415 2022-03-31  7362    19    14   3
21416 2022-03-31  7380   661   680   3
21417 2022-03-31  7390   539   554   3

[7379 rows x 5 columns]
=======
4
              日期  code    進站    出站  月份
21418 2022-04-01   900  6378  5911   4
21419 2022-04-01   910  1277  1355   4
21420 2022-04-01   920  2449  2373   4
21421 2022-04-01   930  6249  6549   4
21422 2022-04-01   940  2661  2685   4
...          ...   ...   ...   ...  ..
28537 2022-04-30  7360  1932  2030   4
28538 2022-04-30  7361    48    59   4
28539 2022-04-30  7362    56    62   4
28540 2022-04-30  7380   349   364   4
28541 2022-04-30  7390   204   236   4

[7124 rows x 5 columns]
=======
5
              日期  code    進站    出站  月份
28542 2022-05-01   900   182   170   5
28543 2022-05-01   910    34    31   5
28544 2022-05-01   920    57    37   5
28545 2022-05-01   930   141   210   5
28546 2022-05-01   940    37    33   5
...          ...   ...   ...   ...  ..
35861 2022-05-31  7360  1878  1918   5
35862 2022-05-31  7361     6    10   5
35863 2022-05-31  7362    11    15   5
35864 2022-05-31  7380   484   484   5
35865 2022-05-31  7390   328   335   5

[7324 rows x 5 columns]
=======
6
              日期  code    進站    出站  月份
35866 2022-06-01   900  4521  4152   6
35867 2022-06-01   910   943   982   6
35868 2022-06-01   920  1656  1512   6
35869 2022-06-01   930  3850  3937   6
35870 2022-06-01   940  1826  1817   6
...          ...   ...   ...   ...  ..
42984 2022-06-30  7360  3215  3149   6
42985 2022-06-30  7361    42    64   6
42986 2022-06-30  7362    98   111   6
42987 2022-06-30  7380   576   585   6
42988 2022-06-30  7390   415   436   6

[7123 rows x 5 columns]
=======
7
              日期  code    進站    出站  月份
42989 2022-07-01   900  6321  5993   7
42990 2022-07-01   910  1119  1168   7
42991 2022-07-01   920  1983  1835   7
42992 2022-07-01   930  4920  4964   7
42993 2022-07-01   940  2278  2127   7
...          ...   ...   ...   ...  ..
50325 2022-07-31  7360  3475  3576   7
50326 2022-07-31  7361    92   140   7
50327 2022-07-31  7362   248   323   7
50328 2022-07-31  7380   413   453   7
50329 2022-07-31  7390   265   272   7

[7341 rows x 5 columns]
=======
8
              日期  code    進站    出站  月份
50330 2022-08-01   900  5929  5441   8
50331 2022-08-01   910  1166  1175   8
50332 2022-08-01   920  2114  1961   8
50333 2022-08-01   930  4814  4986   8
50334 2022-08-01   940  2217  2200   8
...          ...   ...   ...   ...  ..
57688 2022-08-31  7360  3143  3238   8
57689 2022-08-31  7361    47    65   8
57690 2022-08-31  7362    91   104   8
57691 2022-08-31  7380   628   645   8
57692 2022-08-31  7390   475   485   8

[7363 rows x 5 columns]
=======
9
              日期  code    進站    出站  月份
57693 2022-09-01   900  6097  5788   9
57694 2022-09-01   910  1251  1276   9
57695 2022-09-01   920  2172  1996   9
57696 2022-09-01   930  5650  5674   9
57697 2022-09-01   940  2353  2359   9
...          ...   ...   ...   ...  ..
64743 2022-09-30  7360  3930  3839   9
64744 2022-09-30  7361   157   172   9
64745 2022-09-30  7362   123   130   9
64746 2022-09-30  7380   696   741   9
64747 2022-09-30  7390   508   514   9

[7055 rows x 5 columns]
=======
10
              日期  code    進站    出站  月份
64748 2022-10-01   900  7897  7130  10
64749 2022-10-01   910  1019  1143  10
64750 2022-10-01   920  1800  1802  10
64751 2022-10-01   930  3978  3990  10
64752 2022-10-01   940  1755  1744  10
...          ...   ...   ...   ...  ..
72072 2022-10-31  7360  2428  2488  10
72073 2022-10-31  7361     5     4  10
72074 2022-10-31  7362     2     3  10
72075 2022-10-31  7380   629   628  10
72076 2022-10-31  7390   421   406  10

[7329 rows x 5 columns]
=======
11
              日期  code    進站    出站  月份
72077 2022-11-01   900  6193  5927  11
72078 2022-11-01   910  1327  1340  11
72079 2022-11-01   920  2184  1933  11
72080 2022-11-01   930  5922  5873  11
72081 2022-11-01   940  2435  2446  11
...          ...   ...   ...   ...  ..
79184 2022-11-30  7360  3025  3082  11
79185 2022-11-30  7361    22    24  11
79186 2022-11-30  7362    33    37  11
79187 2022-11-30  7380   767   711  11
79188 2022-11-30  7390   499   501  11

[7112 rows x 5 columns]
=======
12
              日期  code    進站    出站  月份
79189 2022-12-01   900  7021  6403  12
79190 2022-12-01   910  1341  1328  12
79191 2022-12-01   920  2314  2070  12
79192 2022-12-01   930  6040  6038  12
79193 2022-12-01   940  2499  2615  12
...          ...   ...   ...   ...  ..
86547 2022-12-31  7360  3984  3893  12
86548 2022-12-31  7361    92   115  12
86549 2022-12-31  7362   131   159  12
86550 2022-12-31  7380   494   426  12
86551 2022-12-31  7390   313   274  12

[7363 rows x 5 columns]
=======

In [26]:
group_dict = dict(list(df1.groupby(by='月份')))

In [28]:
group_dict[10]

              日期  code    進站    出站  月份
64748 2022-10-01   900  7897  7130  10
64749 2022-10-01   910  1019  1143  10
64750 2022-10-01   920  1800  1802  10
64751 2022-10-01   930  3978  3990  10
64752 2022-10-01   940  1755  1744  10
...          ...   ...   ...   ...  ..
72072 2022-10-31  7360  2428  2488  10
72073 2022-10-31  7361     5     4  10
72074 2022-10-31  7362     2     3  10
72075 2022-10-31  7380   629   628  10
72076 2022-10-31  7390   421   406  10

[7329 rows x 5 columns]